blog/2010/09/03/solar-architecture-class-source-solar-solar.php/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Solar架构类/source/solar/Solar.php - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>Solar架构类/source/solar/Solar.php</h1>
  <p>
整体上来说，*Solar*的*架构*做得还是相当不错的。<a href="http://roygu.com/?p=854">前面一篇文章</a>讲过*Solar*的入口文件（引导文件），大家可以再看看，里面用到了<a href="http://solarphp.cn/apidoc/Solar/Solar.html"><b>Solar**架构**类</b></a>。
</p>


<pre class="example">
    // load Solar
require_once 'Solar.php';

// start Solar with system config file
$config = "$system/config.php";
Solar::start($config);
</pre>


<p>
那么*Solar**架构**类*的作用是什么呢？主要完成什么工作呢？这就是本文的主要内容。
</p>

<p>
先还是说说*Solar**架构*，入口文件　+　*Solar**架构**类* +　*Solar**类*库
</p>
<ol class="org-ol">
<li>入口文件：启动*Solar*；
</li>
<li>*Solar**架构**类*：准备*Solar*运行的一切基本条件，定义*Solar*的运行机制、调用*Solar**类*库；
</li>
<li>*Solar**类*库：*Solar*各项功能完成的库文件，这里必须提一下<a href="http://solarphp.cn/apidoc/Solar/Solar_Base.html">Solar\_Base*类*</a>，它是规定*Solar**类*库中所有*类*代码规范、执行流程的基*类*。
</li>
</ol>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
